Revit 2027 API
IFCAnyHandle.Id Property
 The integer identifier for the handle.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Id { get; }
Public ReadOnly Property Id As Integer
	Get
public:
property int Id {
	int get ();
}
member Id : int with get
Property Value
Int32
See Also
Reference
IFCAnyHandle Class
Autodesk.Revit.DB.IFC Namespace